tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1783_tdd.h
#define SCIE                          522
#define PCIE                          523
#define ACKTIM                        524
#define ODCONA0                       525
#define ODCONA                        526
#define ODCONA1                       527
#define ODCONA2                       528
#define ODCONA3                       529
#define ODCONA4                       530
#define ODCONA5                       531
#define ODCONA6                       532
#define ODCONA7                       533
#define ODCONB0                       534
#define ODCONB                        535
#define ODCONB1                       536
#define ODCONB2                       537
#define ODCONB3                       538
#define ODCONB4                       539
#define ODCONB5                       540
#define ODCONB6                       541
#define ODCONB7                       542
#define ODCONC0                       543
#define ODCONC                        544
#define ODCONC1                       545
#define ODCONC2                       546
#define ODCONC3                       547
#define ODCONC4                       548
#define ODCONC5                       549
#define ODCONC6                       550
#define ODCONC7                       551
#define CCPR1L                        552
#define CCPR1H                        553
#define CCP1CON                       554
#define CCP1M0                        555
#define CCP1M                         556
#define CCP1M1                        557
#define CCP1M2                        558
#define CCP1M3                        559
#define DC1B                          560
#define DC1B0                         561
#define DC1B1                         562
#define P1M                           563
#define P1M0                          564
#define P1M1                          565
#define CCPR2L                        566
#define CCPR2H                        567
#define CCP2CON                       568
#define CCP2M                         569
#define CCP2M0                        570
#define CCP2M1                        571
#define CCP2M2                        572
#define CCP2M3                        573
#define DC2B                          574
#define DC2B0                         575
#define DC2B1                         576
#define P2M                           577
#define P2M0                          578
#define P2M1                          579
#define SLRCONA0                      580
#define SLRCONA                       581
#define SLRCONA1                      582
#define SLRCONA2                      583
#define SLRCONA3                      584
#define SLRCONA4                      585
#define SLRCONA5                      586
#define SLRCONA6                      587
#define SLRCONA7                      588
#define SLRCONB                       589
#define SLRCONB0                      590
#define SLRCONB1                      591
#define SLRCONB2                      592
#define SLRCONB3                      593
#define SLRCONB4                      594
#define SLRCONB5                      595
#define SLRCONB6                      596
#define SLRCONB7                      597
#define SLRCONC                       598
#define SLRCONC0                      599
#define SLRCONC1                      600
#define SLRCONC2                      601
#define SLRCONC3                      602
#define SLRCONC4                      603
#define SLRCONC5                      604
#define SLRCONC6                      605
#define SLRCONC7                      606
#define INLVLA                        607
#define INLVLA0                       608
#define INLVLA1                       609
#define INLVLA2                       610
#define INLVLA3                       611
#define INLVLA4                       612
#define INLVLA5                       613
#define INLVLA6                       614
#define INLVLA7                       615
#define INLVLB                        616
#define INLVLB0                       617
#define INLVLB1                       618
#define INLVLB2                       619
#define INLVLB3                       620
#define INLVLB4                       621
#define INLVLB5                       622
#define INLVLB6                       623
#define INLVLB7                       624
#define INLVLC                        625
#define INLVLC0                       626
#define INLVLC1                       627
#define INLVLC2                       628
#define INLVLC3                       629
#define INLVLC4                       630
#define INLVLC5                       631
#define INLVLC6                       632
#define INLVLC7                       633
#define INLVLE                        634
#define INLVLE3                       635
#define IOCAP                         636
#define IOCAP0                        637
#define IOCAP1                        638
#define IOCAP2                        639
#define IOCAP3                        640
#define IOCAP4                        641
#define IOCAP5                        642
#define IOCAP6                        643
#define IOCAP7                        644
#define IOCAN                         645
#define IOCAN0                        646
#define IOCAN1                        647
#define IOCAN2                        648
#define IOCAN3                        649
#define IOCAN4                        650
#define IOCAN5                        651
#define IOCAN6                        652
#define IOCAN7                        653
#define IOCAF0                        654
#define IOCAF                         655
#define IOCAF1                        656
#define IOCAF2                        657
#define IOCAF3                        658
#define IOCAF4                        659
#define IOCAF5                        660
#define IOCAF6                        661
#define IOCAF7                        662
#define IOCBP                         663
#define IOCBP0                        664
#define IOCBP1                        665
#define IOCBP2                        666
#define IOCBP3                        667
#define IOCBP4                        668
#define IOCBP5                        669
#define IOCBP6                        670
#define IOCBP7                        671
#define IOCBN0                        672
#define IOCBN                         673
#define IOCBN1                        674
#define IOCBN2                        675
#define IOCBN3                        676
#define IOCBN4                        677
#define IOCBN5                        678
#define IOCBN6                        679
#define IOCBN7                        680
#define IOCBF0                        681
#define IOCBF                         682
#define IOCBF1                        683
#define IOCBF2                        684
#define IOCBF3                        685
#define IOCBF4                        686
#define IOCBF5                        687
#define IOCBF6                        688
#define IOCBF7                        689
#define IOCCP0                        690
#define IOCCP                         691
#define IOCCP1                        692
#define IOCCP2                        693
#define IOCCP3                        694
#define IOCCP4                        695
#define IOCCP5                        696
#define IOCCP6                        697
#define IOCCP7                        698
#define IOCCN0                        699
#define IOCCN                         700
#define IOCCN1                        701
#define IOCCN2                        702
#define IOCCN3                        703
#define IOCCN4                        704
#define IOCCN5                        705
#define IOCCN6                        706
#define IOCCN7                        707
#define IOCCF0                        708
#define IOCCF                         709
#define IOCCF1                        710
#define IOCCF2                        711
#define IOCCF3                        712
#define IOCCF4                        713
#define IOCCF5                        714
#define IOCCF6                        715
#define IOCCF7                        716
#define IOCEP                         717
#define IOCEP3                        718
#define IOCEN                         719
#define IOCEN3                        720
#define IOCEF                         721
#define IOCEF3                        722
#define OPA1CON                       723
#define OPA1CH0                       724
#define OPA1CH                        725
#define OPA1CH1                       726
#define OPA1SP                        727
#define OPA1EN                        728
#define OPA2CON                       729
#define OPA2CH                        730
#define OPA2CH0                       731
#define OPA2CH1                       732
#define OPA2SP                        733
#define OPA2EN                        734
#define CLKRCON                       735
#define CLKRDIV                       736
#define CLKRDIV0                      737
#define CLKRDIV1                      738
#define CLKRDIV2                      739
#define CLKRDC                        740
#define CLKRDC0                       741
#define CLKRDC1                       742
#define CLKRSLR                       743
#define CLKROE                        744
#define CLKREN                        745
#define PSMC1CON                      746
#define P1MODE                        747
#define P1MODE0                       748
#define P1MODE1                       749
#define P1MODE2                       750
#define P1MODE3                       751
#define P1DBRE                        752
#define P1DBFE                        753
#define PSMC1LD                       754
#define PSMC1EN                       755
#define PSMC1MDL                      756
#define P1MSRC0                       757
#define P1MSRC                        758
#define P1MSRC1                       759
#define P1MSRC2                       760
#define P1MSRC3                       761
#define P1MDLBIT                      762
#define P1MDLPOL                      763
#define P1MDLEN                       764
#define PSMC1SYNC                     765
#define P1SYNC0                       766
#define P1SYNC1                       767
#define PSMC1CLK                      768
#define P1CSRC                        769
#define P1CSRC0                       770
#define P1CSRC1                       771
#define P1CPRE                        772
#define P1CPRE0                       773
#define P1CPRE1                       774
#define PSMC1OEN                      775
#define P1OEA                         776
#define P1OEB                         777
#define P1OEC                         778
#define P1OED                         779
#define P1OEE                         780
#define P1OEF                         781
#define PSMC1POL                      782
#define P1POLA                        783
#define P1POLB                        784
#define P1POLC                        785
#define P1POLD                        786
#define P1POLE                        787
#define P1POLF                        788
#define P1INPOL                       789
#define PSMC1BLNK                     790
#define P1REBM                        791
#define P1REBM0                       792
#define P1REBM1                       793
#define P1FEBM0                       794
#define P1FEBM                        795
#define P1FEBM1                       796
#define PSMC1REBS                     797
#define P1REBSC1                      798
#define P1REBSC2                      799
#define P1REBSC3                      800
#define P1REBSIN                      801
#define PSMC1FEBS                     802
#define P1FEBSC1                      803
#define P1FEBSC2                      804
#define P1FEBSC3                      805
#define P1FEBSIN                      806
#define PSMC1PHS                      807
#define P1PHST                        808
#define P1PHSC1                       809
#define P1PHSC2                       810
#define P1PHSC3                       811
#define P1PHSIN                       812
#define PSMC1DCS                      813
#define P1DCST                        814
#define P1DCSC1                       815
#define P1DCSC2                       816
#define P1DCSC3                       817
#define P1DCSIN                       818
#define PSMC1PRS                      819
#define P1PRST                        820
#define P1PRSC1                       821
#define P1PRSC2                       822
#define P1PRSC3                       823
#define P1PRSIN                       824
#define PSMC1ASDC                     825
#define P1ASDOV                       826
#define P1ARSEN                       827
#define P1ASDEN                       828
#define P1ASE                         829
#define PSMC1ASDL                     830
#define P1ASDLA                       831
#define P1ASDLB                       832
#define P1ASDLC                       833
#define P1ASDLD                       834
#define P1ASDLE                       835
#define P1ASDLF                       836
#define PSMC1ASDS                     837
#define P1ASDSC1                      838
#define P1ASDSC2                      839
#define P1ASDSC3                      840
#define P1ASDSIN                      841
#define PSMC1INT                      842
#define P1TPRIF                       843
#define P1TDCIF                       844
#define P1TPHIF                       845
#define P1TOVIF                       846
#define P1TPRIE                       847
#define P1TDCIE                       848
#define P1TPHIE                       849
#define P1TOVIE                       850
#define PSMC1PHL                      851
#define PSMC1PH0                      852
#define PSMC1PH1                      853
#define PSMC1PH2                      854
#define PSMC1PH3                      855
#define PSMC1PH4                      856
#define PSMC1PH5                      857
#define PSMC1PH6                      858
#define PSMC1PH7                      859
#define PSMC1PHH                      860
#define PSMC1PH8                      861
#define PSMC1PH9                      862
#define PSMC1PH10                     863
#define PSMC1PH11                     864
#define PSMC1PH12                     865
#define PSMC1PH13                     866
#define PSMC1PH14                     867
#define PSMC1PH15                     868
#define PSMC1DCL                      869
#define PSMC1DC0                      870
#define PSMC1DC1                      871
#define PSMC1DC2                      872
#define PSMC1DC3                      873
#define PSMC1DC4                      874
#define PSMC1DC5                      875
#define PSMC1DC6                      876
#define PSMC1DC7                      877
#define PSMC1DCH                      878
#define PSMC1DC8                      879
#define PSMC1DC9                      880
#define PSMC1DC10                     881
#define PSMC1DC11                     882
#define PSMC1DC12                     883
#define PSMC1DC13                     884
#define PSMC1DC14                     885
#define PSMC1DC15                     886
#define PSMC1PRL                      887
#define PSMC1PR0                      888
#define PSMC1PR1                      889
#define PSMC1PR2                      890
#define PSMC1PR3                      891
#define PSMC1PR4                      892
#define PSMC1PR5                      893
#define PSMC1PR6                      894
#define PSMC1PR7                      895
#define PSMC1PRH                      896
#define PSMC1PR8                      897
#define PSMC1PR9                      898
#define PSMC1PR10                     899
#define PSMC1PR11                     900
#define PSMC1PR12                     901
#define PSMC1PR13                     902
#define PSMC1PR14                     903
#define PSMC1PR15                     904
#define PSMC1TMRL                     905
#define PSMC1TMR0                     906
#define PSMC1TMR1                     907
#define PSMC1TMR2                     908
#define PSMC1TMR3                     909
#define PSMC1TMR4                     910
#define PSMC1TMR5                     911
#define PSMC1TMR6                     912
#define PSMC1TMR7                     913
#define PSMC1TMRH                     914
#define PSMC1TMR8                     915
#define PSMC1TMR9                     916
#define PSMC1TMR10                    917
#define PSMC1TMR11                    918
#define PSMC1TMR12                    919
#define PSMC1TMR13                    920
#define PSMC1TMR14                    921
#define PSMC1TMR15                    922
#define PSMC1DBR                      923
#define PSMC1DBR0                     924
#define PSMC1DBR1                     925
#define PSMC1DBR2                     926
#define PSMC1DBR3                     927
#define PSMC1DBR4                     928
#define PSMC1DBR5                     929
#define PSMC1DBR6                     930
#define PSMC1DBR7                     931
#define PSMC1DBF                      932
#define PSMC1DBF0                     933
#define PSMC1DBF1                     934
#define PSMC1DBF2                     935
#define PSMC1DBF3                     936
#define PSMC1DBF4                     937
#define PSMC1DBF5                     938
#define PSMC1DBF6                     939
#define PSMC1DBF7                     940
#define PSMC1BLKR                     941
#define PSMC1BLKR0                    942
#define PSMC1BLKR1                    943
#define PSMC1BLKR2                    944
#define PSMC1BLKR3                    945
#define PSMC1BLKR4                    946
#define PSMC1BLKR5                    947
#define PSMC1BLKR6                    948
#define PSMC1BLKR7                    949
#define PSMC1BLKF                     950
#define PSMC1BLKF0                    951
#define PSMC1BLKF1                    952
#define PSMC1BLKF2                    953
#define PSMC1BLKF3                    954
#define PSMC1BLKF4                    955
#define PSMC1BLKF5                    956
#define PSMC1BLKF6                    957
#define PSMC1BLKF7                    958
#define PSMC1FFA                      959
#define PSMC1FFA0                     960
#define PSMC1FFA1                     961
#define PSMC1FFA2                     962
#define PSMC1FFA3                     963
#define PSMC1STR0                     964
#define P1STRA                        965
#define P1STRB                        966
#define P1STRC                        967
#define P1STRD                        968
#define P1STRE                        969
#define P1STRF                        970
#define PSMC1STR1                     971
#define P1HSMEN                       972
#define P1LSMEN                       973
#define P1SSYNC                       974
#define PSMC2CON                      975
#define P2MODE                        976
#define P2MODE0                       977
#define P2MODE1                       978
#define P2MODE2                       979
#define P2MODE3                       980
#define P2DBRE                        981
#define P2DBFE                        982
#define PSMC2LD                       983
#define PSMC2EN                       984
#define PSMC2MDL                      985
#define P2MSRC                        986
#define P2MSRC0                       987
#define P2MSRC1                       988
#define P2MSRC2                       989
#define P2MSRC3                       990
#define P2MDLBIT                      991
#define P2MDLPOL                      992
#define P2MDLEN                       993
#define PSMC2SYNC                     994
#define P2SYNC0                       995
#define P2SYNC1                       996
#define PSMC2CLK                      997
#define P2CSRC0                       998
#define P2CSRC                        999
#define P2CSRC1                       1000
#define P2CPRE                        1001
#define P2CPRE0                       1002
#define P2CPRE1                       1003
#define PSMC2OEN                      1004
#define P2OEA                         1005
#define P2OEB                         1006
#define PSMC2POL                      1007
#define P2POLA                        1008
#define P2POLB                        1009
#define P2INPOL                       1010
#define PSMC2BLNK                     1011
#define P2REBM                        1012
#define P2REBM0                       1013
#define P2REBM1                       1014
#define P2FEBM0                       1015
#define P2FEBM                        1016
#define P2FEBM1                       1017
#define PSMC2REBS                     1018
#define P2REBSC1                      1019
#define P2REBSC2                      1020
#define P2REBSC3                      1021
#define P2REBSIN                      1022
#define PSMC2FEBS                     1023
#define P2FEBSC1                      1024
#define P2FEBSC2                      1025
#define P2FEBSC3                      1026
#define P2FEBSIN                      1027
#define PSMC2PHS                      1028
#define P2PHST                        1029
#define P2PHSC1                       1030
#define P2PHSC2                       1031
#define P2PHSC3                       1032
#define P2PHSIN                       1033
#define PSMC2DCS                      1034
#define P2DCST                        1035
#define P2DCSC1                       1036
#define P2DCSC2                       1037
#define P2DCSC3                       1038
#define P2DCSIN                       1039
#define PSMC2PRS                      1040
#define P2PRST                        1041
#define P2PRSC1                       1042
#define P2PRSC2                       1043
#define P2PRSC3                       1044
#define P2PRSIN                       1045
#define PSMC2ASDC                     1046
#define P2ASDOV                       1047
#define P2ARSEN                       1048
#define P2ASDEN                       1049
#define P2ASE                         1050
#define PSMC2ASDL                     1051
#define P2ASDLA                       1052
#define P2ASDLB                       1053
#define PSMC2ASDS                     1054
#define P2ASDSC1                      1055
#define P2ASDSC2                      1056
#define P2ASDSC3                      1057
#define P2ASDSIN                      1058
#define PSMC2INT                      1059
#define P2TPRIF                       1060
#define P2TDCIF                       1061
#define P2TPHIF                       1062
#define P2TOVIF                       1063
#define P2TPRIE                       1064
#define P2TDCIE                       1065
#define P2TPHIE                       1066
#define P2TOVIE                       1067
#define PSMC2PHL                      1068
#define PSMC2PH0                      1069
#define PSMC2PH1                      1070
#define PSMC2PH2                      1071
#define PSMC2PH3                      1072
#define PSMC2PH4                      1073
#define PSMC2PH5                      1074
#define PSMC2PH6                      1075
#define PSMC2PH7                      1076
#define PSMC2PHH                      1077
#define PSMC2PH8                      1078
#define PSMC2PH9                      1079
#define PSMC2PH10                     1080
#define PSMC2PH11                     1081
#define PSMC2PH12                     1082
#define PSMC2PH13                     1083
#define PSMC2PH14                     1084
#define PSMC2PH15                     1085
#define PSMC2DCL                      1086
#define PSMC2DC0                      1087
#define PSMC2DC1                      1088
#define PSMC2DC2                      1089
#define PSMC2DC3                      1090
